In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame([[1,2,3],[3,4,5],[6,7,8]],columns=["A",'B','C'])
df.head()

   A  B  C
0  1  2  3
1  3  4  5
2  6  7  8

In [3]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [4]:
df.index.tolist()

[0, 1, 2]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [6]:
age=pd.Series([22,35,58],name='age')
age

0    22
1    35
2    58
Name: age, dtype: int64

In [7]:
a=pd.DataFrame({
    'Name':['Braund','Akash','Maqbool','Saheer'],
    "age":[22,24,21,21],
    'sex':['male','male','male','male']
})
a

      Name  age   sex
0   Braund   22  male
1    Akash   24  male
2  Maqbool   21  male
3   Saheer   21  male

In [8]:
a=pd.Series([])
a

Series([], dtype: object)

In [9]:
s=pd.Series(dtype='float')
s

Series([], dtype: float64)

In [10]:
a=np.array(['a','b','c','d'])
s=pd.Series(a)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [11]:
a=np.array(['a','b','c','d'])
s=pd.Series(a,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [12]:
b={'akash':"Data",'data':"akash"}
print(b)
c=pd.Series(b,index=['a','b'])
print(c)

{'akash': 'Data', 'data': 'akash'}
a    NaN
b    NaN
dtype: object

In [13]:
b={'akash':1,'data':2}
c = pd.Series(b, index=['akash', 'data'])
print(c)

akash    1
data     2
dtype: int64

# Create a Series

- Create a Pandas Series containing the numbers from 5 to 15.

- Print the Series and its index.

In [14]:
se=pd.Series(range(5,15))
print(se)
print(se.index)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64
RangeIndex(start=0, stop=10, step=1)

# Create a DataFrame from a dictionary
- Create a DataFrame and print it.

- Print its shape and column names.

In [15]:
data = {
    "Student": ["Aisha", "Rahul", "Sana", "Arjun"],
    "Marks": [85, 90, 78, 92]
}
df=pd.DataFrame(data)
df

  Student  Marks
0   Aisha     85
1   Rahul     90
2    Sana     78
3   Arjun     92

In [16]:
print(df.columns)
print(df.shape)

Index(['Student', 'Marks'], dtype='object')
(4, 2)

# Convert a NumPy array to a DataFrame

- Generate a random 3×4 NumPy array of integers (1–20).

- Convert it into a DataFrame with column names: A, B, C, D.

- Print the DataFrame.

In [17]:
arr=np.random.randint(1,20,(3,4))
df=pd.DataFrame(arr,columns=['A',"B","C","D"])
df

    A   B   C   D
0  15  17  19   9
1   9   8   2  17
2  16   4  18   2

# Rename columns

- Rename columns A, B, C, D to Math, Physics, Chemistry, Biology.

- Print the updated DataFrame.

In [18]:
df
df.rename(columns={"A":"Math",'B':"Physics",'C':'Chemistry',"D":"Biology"},inplace=True)

# Add a new calculated column

- Add a column called Total which is the sum of all 4 subject marks for      each student.

- Print the DataFrame.

In [23]:

df['Total']=df.sum(axis=1)

In [24]:
df

   Math  Physics  Chemistry  Biology  Total
0    15       17         19        9    180
1     9        8          2       17    108
2    16        4         18        2    120

In [27]:
import numpy as np
import pandas as pd
arr = np.random.randint(1, 20, (3, 4))
df = pd.DataFrame(arr, columns=['Math', 'Physics', 'Chemistry', 'Biology'])
df['Total'] = df.sum(axis=1)
df

   Math  Physics  Chemistry  Biology  Total
0    16       18          4       11     49
1    11       10          6       13     40
2     3       19          1       18     41

# Boolean filtering

- Filter students who scored more than 40 in Physics.

- Print their rows only

In [39]:
phy=df[df['Physics']>15]
phy

   Math  Physics  Chemistry  Biology  Total
0    16       18          4       11     49
2     3       19          1       18     41

# Using loc and iloc

- Using the same DataFrame, select:

- The row for 'Rahul' using loc (assume the index is the student name).

- The first two rows and first three columns using iloc.

In [40]:
df

   Math  Physics  Chemistry  Biology  Total
0    16       18          4       11     49
1    11       10          6       13     40
2     3       19          1       18     41

In [48]:
print(df.loc[1,'Math'])

11

In [54]:
df.iloc[0:2,:3]

   Math  Physics  Chemistry
0    16       18          4
1    11       10          6

In [1]:
import pandas as pd

In [3]:
s=pd.Series([1,2,3,4,],index=['a','b','c','d'])
print(s)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
print(s[0])

1

C:\Users\akash\AppData\Local\Temp\ipykernel_10376\287792665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [9]:
data={
    'student':['amith','jhon','jacob','David','steve'],
    'rank':[1,2,3,4,5],
    "mark":[95,70,80,60,90]
}
df=pd.DataFrame(data)
df

  student  rank  mark
0   amith     1    95
1    jhon     2    70
2   jacob     3    80
3   David     4    60
4   steve     5    90

In [14]:
df.loc[0,'student']

'amith'

In [17]:
a=pd.Series(data=None,dtype=int)
print(type(a))

<class 'pandas.core.series.Series'>

In [18]:
data=[1000,1200,1100,950,1050,1430,1760]
day=['Day1','Day2','Day3',"Day4","Day5",'Day6','Day7']
df=pd.Series(data=data,index=day,name='production')

In [19]:
df

Day1    1000
Day2    1200
Day3    1100
Day4     950
Day5    1050
Day6    1430
Day7    1760
Name: production, dtype: int64

In [21]:
 df.name

'production'

In [22]:
df.index

Index(['Day1', 'Day2', 'Day3', 'Day4', 'Day5', 'Day6', 'Day7'], dtype='object')

In [23]:
df.values

array([1000, 1200, 1100,  950, 1050, 1430, 1760])

In [24]:
df.dtype

dtype('int64')

In [25]:
df.shape

(7,)

In [26]:
df.ndim

1

In [27]:
df.size

7

In [28]:
len(df)

7

In [29]:
df.empty

False

In [32]:
type(df['Day2'])

numpy.int64

In [37]:
df

Day1    1000
Day2    1200
Day3    1100
Day4     950
Day5    1050
Day6    1430
Day7    1760
Name: daily prod, dtype: int64

In [36]:
df.rename(index='daily prod',inplace=True)

Day1    1000
Day2    1200
Day3    1100
Day4     950
Day5    1050
Day6    1430
Day7    1760
Name: daily prod, dtype: int64

In [38]:
df.reset_index()

  index  daily prod
0  Day1        1000
1  Day2        1200
2  Day3        1100
3  Day4         950
4  Day5        1050
5  Day6        1430
6  Day7        1760

In [42]:
df.reset_index(drop=True)

0    1000
1    1200
2    1100
3     950
4    1050
5    1430
6    1760
Name: daily prod, dtype: int64

In [43]:
df.index=['mon','tue','wed','thu','fri','sat','sun']

In [44]:
df

mon    1000
tue    1200
wed    1100
thu     950
fri    1050
sat    1430
sun    1760
Name: daily prod, dtype: int64

In [45]:
import numpy as np

In [46]:
a=np.array(['Maq',"Swali",'Adhil',"parthiv"])
b=np.array([7634,9088,5055,2025])

In [50]:
emp=pd.Series(a,b)
emp

7634        Maq
9088      Swali
5055      Adhil
2025    parthiv
dtype: object

In [51]:
df

mon    1000
tue    1200
wed    1100
thu     950
fri    1050
sat    1430
sun    1760
Name: daily prod, dtype: int64

In [52]:
df>1000

mon    False
tue     True
wed     True
thu    False
fri     True
sat     True
sun     True
Name: daily prod, dtype: bool

In [53]:
df[df>1000]

tue    1200
wed    1100
fri    1050
sat    1430
sun    1760
Name: daily prod, dtype: int64

In [54]:
df[(df>1000)&(df<1500)]

tue    1200
wed    1100
fri    1050
sat    1430
Name: daily prod, dtype: int64

In [56]:
df.idxmin()

'thu'

In [60]:
df.min()

950

In [65]:
df.sort_values(ascending=False)

sun    1760
sat    1430
tue    1200
wed    1100
fri    1050
mon    1000
thu     950
Name: daily prod, dtype: int64

In [66]:
df.sum()

np.int64(8490)

In [67]:
df.mean()

np.float64(1212.857142857143)

In [71]:
cus_data=[['001','alice','alice@gmail.com','123-456-789',20],
          ['001','miya','miya@gmail.com','123-376-459',15],
          ['001','lyla','lyla@gmail.com','123-011-479',25]
         ]
cus_cols=['coutmer_id','name','email',"moblie",'total_purchase']
df=pd.DataFrame(data=cus_data,columns=cus_cols)

In [72]:
df

  coutmer_id   name            email       moblie  total_purchase
0        001  alice  alice@gmail.com  123-456-789              20
1        001   miya   miya@gmail.com  123-376-459              15
2        001   lyla   lyla@gmail.com  123-011-479              25

In [74]:
cus_data=[['001','alice','alice@gmail.com','123-456-789',20],
          ['001','miya','miya@gmail.com','123-376-459',15],
          ['001','lyla','lyla@gmail.com','123-011-479',25]
         ]
cus_cols=['coutmer_id','name','email',"moblie",'total_purchase']
cus_ind=['A',"B",'C']
df=pd.DataFrame(data=cus_data,columns=cus_cols,index=cus_ind)

In [75]:
df

  coutmer_id   name            email       moblie  total_purchase
A        001  alice  alice@gmail.com  123-456-789              20
B        001   miya   miya@gmail.com  123-376-459              15
C        001   lyla   lyla@gmail.com  123-011-479              25

In [3]:
df=pd.read_csv('D:/DSML/DataSet/housepricedata_(1).csv')
df

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [4]:
df.head(5)

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1

In [5]:
df.head()

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1

In [6]:
df.tail()

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [7]:
df.columns

Index(['LotArea', 'OverallQual', 'OverallCond', 'TotalBsmtSF', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'TotRmsAbvGrd', 'Fireplaces', 'GarageArea',
       'AboveMedianPrice'],
      dtype='object')

In [8]:
df.axes

[RangeIndex(start=0, stop=1460, step=1),
 Index(['LotArea', 'OverallQual', 'OverallCond', 'TotalBsmtSF', 'FullBath',
        'HalfBath', 'BedroomAbvGr', 'TotRmsAbvGrd', 'Fireplaces', 'GarageArea',
        'AboveMedianPrice'],
       dtype='object')]

In [9]:
df.shape

(1460, 11)

In [10]:
df.index

RangeIndex(start=0, stop=1460, step=1)

In [11]:
df.keys()

Index(['LotArea', 'OverallQual', 'OverallCond', 'TotalBsmtSF', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'TotRmsAbvGrd', 'Fireplaces', 'GarageArea',
       'AboveMedianPrice'],
      dtype='object')

In [12]:
df

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1460 entries, 0 to 1459
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LotArea           1460 non-null   int64
 1   OverallQual       1460 non-null   int64
 2   OverallCond       1460 non-null   int64
 3   TotalBsmtSF       1460 non-null   int64
 4   FullBath          1460 non-null   int64
 5   HalfBath          1460 non-null   int64
 6   BedroomAbvGr      1460 non-null   int64
 7   TotRmsAbvGrd      1460 non-null   int64
 8   Fireplaces        1460 non-null   int64
 9   GarageArea        1460 non-null   int64
 10  AboveMedianPrice  1460 non-null   int64
dtypes: int64(11)
memory usage: 125.6 KB

In [14]:
df.describe()

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
count,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000,1460.000000
mean,10516.828082,6.099315,5.575342,1057.429452,1.565068,0.382877,2.866438,6.517808,0.613014,472.980137,0.498630
std,9981.264932,1.382997,1.112799,438.705324,0.550916,0.502885,0.815778,1.625393,0.644666,213.804841,0.500169
min,1300.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000
25%,7553.500000,5.000000,5.000000,795.750000,1.000000,0.000000,2.000000,5.000000,0.000000,334.500000,0.000000
50%,9478.500000,6.000000,5.000000,991.500000,2.000000,0.000000,3.000000,6.000000,1.000000,480.000000,0.000000
75%,11601.500000,7.000000,6.000000,1298.250000,2.000000,1.000000,3.000000,7.000000,1.000000,576.000000,1.000000
max,215245.000000,10.000000,9.000000,6110.000000,3.000000,2.000000,8.000000,14.000000,3.000000,1418.000000,1.000000

In [15]:
df

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [16]:
df[['TotalBsmtSF','OverallCond']]

      TotalBsmtSF  OverallCond
0             856            5
1            1262            8
2             920            5
3             756            5
4            1145            5
...           ...          ...
1455          953            5
1456         1542            6
1457         1152            9
1458         1078            6
1459         1256            6

[1460 rows x 2 columns]

In [17]:
df['OverallCond'][10]

np.int64(5)

In [18]:
df.loc[0,['OverallCond','TotalBsmtSF']]

OverallCond      5
TotalBsmtSF    856
Name: 0, dtype: int64

In [19]:
df.loc[0:6,['OverallCond','TotalBsmtSF']]

   OverallCond  TotalBsmtSF
0            5          856
1            8         1262
2            5          920
3            5          756
4            5         1145
5            5          796
6            5         1686

In [20]:
import pandas as pd 
import numpy as np

In [21]:
df

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [22]:
df.at[3,'OverallCond']

np.int64(5)

In [25]:
df.select_dtypes(include=int)

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

# arthimatic oparation

In [38]:
df['TotalBsmtSF'] = (df['TotalBsmtSF'] / 10).round(1)

In [40]:
df[['TotalBsmtSF']]

      TotalBsmtSF
0            85.6
1           126.2
2            92.0
3            75.6
4           114.5
...           ...
1455         95.3
1456        154.2
1457        115.2
1458        107.8
1459        125.6

[1460 rows x 1 columns]

In [29]:
df['FullBath'].add(5)

0       7
1       7
2       7
3       6
4       7
       ..
1455    7
1456    7
1457    7
1458    6
1459    6
Name: FullBath, Length: 1460, dtype: int64

In [30]:
df.round()

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,BedroomAbvGr,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
0,8450,7,5,856,2,1,3,8,0,548,1
1,9600,6,8,1262,2,0,3,6,1,460,1
2,11250,7,5,920,2,1,3,6,1,608,1
3,9550,7,5,756,1,0,3,7,1,642,0
4,14260,8,5,1145,2,1,4,9,1,836,1
...,...,...,...,...,...,...,...,...,...,...,...
1455,7917,6,5,953,2,1,3,7,1,460,1
1456,13175,6,6,1542,2,0,3,7,2,500,1
1457,9042,7,9,1152,2,0,4,9,2,252,1
1458,9717,5,6,1078,1,0,2,5,0,240,0
1459,9937,5,6,1256,1,1,3,6,0,276,0

In [41]:
df['TotRmsAbvGrd'].sum()

np.int64(9516)

In [42]:
df['TotRmsAbvGrd'].mean()

np.float64(6.517808219178082)

In [43]:
df['TotRmsAbvGrd'].max()

14

In [47]:
df['TotRmsAbvGrd'].min()

2

In [48]:
df['TotRmsAbvGrd'].idxmin()

533

In [50]:
df['TotRmsAbvGrd'].median()

6.0

In [54]:
df['TotRmsAbvGrd'].unique()

array([ 8,  6,  7,  9,  5, 11,  4, 10, 12,  3,  2, 14])

In [56]:
df['TotRmsAbvGrd'].value_counts()

TotRmsAbvGrd
6     402
7     329
5     275
8     187
4      97
9      75
10     47
11     18
3      17
12     11
2       1
14      1
Name: count, dtype: int64

In [57]:
df['TotRmsAbvGrd'].mode()

0    6
Name: TotRmsAbvGrd, dtype: int64

In [58]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
LotArea,1460.0,10516.828082,9981.264932,1300.0,7553.500,9478.50,11601.500,215245.0
OverallQual,1460.0,6.099315,1.382997,1.0,5.000,6.00,7.000,10.0
OverallCond,1460.0,5.575342,1.112799,1.0,5.000,5.00,6.000,9.0
TotalBsmtSF,1460.0,105.742945,43.870532,0.0,79.575,99.15,129.825,611.0
FullBath,1460.0,1.565068,0.550916,0.0,1.000,2.00,2.000,3.0
HalfBath,1460.0,0.382877,0.502885,0.0,0.000,0.00,1.000,2.0
BedroomAbvGr,1460.0,2.866438,0.815778,0.0,2.000,3.00,3.000,8.0
TotRmsAbvGrd,1460.0,6.517808,1.625393,2.0,5.000,6.00,7.000,14.0
Fireplaces,1460.0,0.613014,0.644666,0.0,0.000,1.00,1.000,3.0
GarageArea,1460.0,472.980137,213.804841,0.0,334.500,480.00,576.000,1418.0
AboveMedianPrice,1460.0,0.498630,0.500169,0.0,0.000,0.00,1.000,1.0

In [60]:
df[['TotRmsAbvGrd','FullBath']].aggregate('mean')

TotRmsAbvGrd    6.517808
FullBath        1.565068
dtype: float64

In [61]:
df.aggregate({"FullBath":'median','BedroomAbvGr':'mean'})

FullBath        2.000000
BedroomAbvGr    2.866438
dtype: float64

In [62]:
df.groupby(by='BedroomAbvGr')

In [63]:
df.groupby(by='BedroomAbvGr').mean(numeric_only=True)

,LotArea,OverallQual,OverallCond,TotalBsmtSF,FullBath,HalfBath,TotRmsAbvGrd,Fireplaces,GarageArea,AboveMedianPrice
BedroomAbvGr,,,,,,,,,,
0,18152.333333,6.333333,5.666667,127.816667,0.166667,0.833333,4.500000,0.500000,583.666667,0.500000
1,7867.760000,5.760000,5.240000,103.660000,1.080000,0.280000,4.480000,0.620000,452.720000,0.420000
2,8483.189944,5.826816,5.575419,100.046648,1.393855,0.150838,5.332402,0.466480,434.393855,0.349162
3,10854.723881,6.165423,5.609453,107.760323,1.573383,0.422886,6.575871,0.634328,482.707711,0.534826
4,12922.122066,6.436620,5.535211,107.009390,1.920188,0.638498,8.342723,0.784038,511.122066,0.643192
5,12362.190476,5.904762,5.619048,101.933333,1.952381,0.380952,9.761905,0.809524,428.857143,0.476190
6,9310.428571,5.000000,4.857143,128.742857,2.000000,0.285714,10.428571,0.000000,418.285714,0.142857
8,10896.000000,6.000000,7.000000,144.000000,2.000000,0.000000,14.000000,0.000000,0.000000,1.000000

In [64]:
df.groupby(by='BedroomAbvGr')['TotRmsAbvGrd'].mean()

BedroomAbvGr
0     4.500000
1     4.480000
2     5.332402
3     6.575871
4     8.342723
5     9.761905
6    10.428571
8    14.000000
Name: TotRmsAbvGrd, dtype: float64

In [66]:
df.groupby(by='BedroomAbvGr')['TotRmsAbvGrd'].apply(np.mean)

BedroomAbvGr
0     4.500000
1     4.480000
2     5.332402
3     6.575871
4     8.342723
5     9.761905
6    10.428571
8    14.000000
Name: TotRmsAbvGrd, dtype: float64

In [67]:
data = {
    'Department': ['IT', 'IT', 'HR', 'HR', 'Finance'],
    'Salary': [50000, 60000, 45000, 47000, 70000]
}
df = pd.DataFrame(data)

# Group by Department and calculate average salary
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
Finance    70000.0
HR         46000.0
IT         55000.0
Name: Salary, dtype: float64